code-review/NRB_3471_3546/База_Было/Documents/ПериодыПребыванияВРФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПериодыПребыванияВРФ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПрисутствиеНаТерриторииРФ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокПериодов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НачалоПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонецПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Местонахождение</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыМестонахожденияКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/InformationRegisters/ПрисутствиеНаТерриторииРФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПрисутствиеНаТерриторииРФ</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Местонахождение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыМестонахожденияКлиента</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/ПериодыПребыванияВРФ/Forms/ФормаКалендарь/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПериодКалендаря	= Год(ТекущаяДата());
	Календарь		= ТекущаяДата();
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеКалендаряСервер()
	ДатаУстановки = Дата(Формат(ПериодКалендаря,"ЧГ=0")+"0101");
	
	Элементы.Календарь.НачалоПериодаОтображения = НачалоГода(ДатаУстановки);
	Элементы.Календарь.КонецПериодаОтображения	= КонецГода(ДатаУстановки);
КонецПроцедуры // ()

&НаСервере
Процедура ЗаполнитьДанныеПериодовНахожденияСервер()
	Запрос	= Новый Запрос;
	
	ДатаУстановки = Дата(Формат(ПериодКалендаря,"ЧГ=0")+"0101");
	
	Запрос.УстановитьПараметр("НачалоПериода"	, НачалоГода(ДатаУстановки));
	Запрос.УстановитьПараметр("КонецПериода"	, КонецГода(ДатаУстановки));
	Запрос.УстановитьПараметр("ДатаРасчета"		, КонецДня(ДатаРасчета));
	Запрос.УстановитьПараметр("Клиент"			, Клиент);
	
	Запрос.Текст	= "
	|ВЫБРАТЬ
	|	ПрисутствиеНаТерриторииРФСрезПоследних.Дата				КАК Дата,
	|   ПрисутствиеНаТерриторииРФСрезПоследних.Местонахождение КАК Место
	|ИЗ
	|	РегистрСведений.ПрисутствиеНаТерриторииРФ.СрезПоследних(&ДатаРасчета, ) КАК ПрисутствиеНаТерриторииРФСрезПоследних
	|ГДЕ
	|	ПрисутствиеНаТерриторииРФСрезПоследних.Дата >= &НачалоПериода
	|	И
	|	ПрисутствиеНаТерриторииРФСрезПоследних.Дата <= &КонецПериода
	|	И
	|	ПрисутствиеНаТерриторииРФСрезПоследних.Клиент = &Клиент
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	
	ПериодыПрисутствия.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры // ЗаполнитьданныеПериодовНахожденияСервер()

&НаКлиенте
Процедура ПериодКалендаряПриИзменении(Элемент)
	КлиентПриИзменении();
	ОбновитьДанныеКалендаряСервер();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	КлиентПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура КалендарьПриВыводеПериода(Элемент, ОформлениеПериода)
	Если Не Клиент.Пустая() Тогда
		ОформлятьДаты	= Истина;
	Иначе
		ОформлятьДаты	= Ложь;
	КонецЕсли; 
	
	ОформлениеДат	= ОформлениеПериода.Даты;
	
	Для Каждого ОформляемаяДата Из ОформлениеДат Цикл
		МассивНайденныхСтрок	= ПериодыПрисутствия.НайтиСтроки(Новый Структура("Дата ", ОформляемаяДата.Дата));
		// Дата писутсвия флаг
		// 1 - в рф, 2 - вне рф, 3 - неопределено
		ФлагПрисутствия	= 3;
		Если МассивНайденныхСтрок.Количество()>0 Тогда
			ФлагПрисутствия	= ?(МассивНайденныхСтрок[0].Место = ПредопределенноеЗначение("Перечисление.ТипыМестонахожденияКлиента.ВнеТерриторииРФ"), 2, 1);
			
		КонецЕсли;
		// Оформляем
		Если ФлагПрисутствия = 3 Тогда
			ОформляемаяДата.ЦветФона	= Новый Цвет();
		ИначеЕсли ФлагПрисутствия = 2 Тогда
			ОформляемаяДата.ЦветФона	= Новый Цвет(255,204,0);
		ИначеЕсли ФлагПрисутствия = 1 Тогда
			ОформляемаяДата.ЦветФона	= Новый Цвет(153,204,0);
		КонецЕсли;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент=Неопределено)
	Если Не Клиент.Пустая() Тогда
		ЗаполнитьДанныеПериодовНахожденияСервер();
	Иначе
		ПериодыПрисутствия.Очистить();
	КонецЕсли;
	ОбновитьДанныеКалендаряСервер();
КонецПроцедуры

&НаКлиенте
Процедура ДатаРасчетаПриИзменении(Элемент)
	КлиентПриИзменении();
	ОбновитьДанныеКалендаряСервер();
КонецПроцедуры
